1)Count all letters, digits, and special symbols from a given
string
str1 = "I@#ma26rt^&ic5us"

In [216]:
str1 = "I@#ma26rt^&ic5us"
sepcial_sym ="~`!@#$%^&*"
digits="1234567890"
letters="qwertyuiopasdfghjklzxcvbnmQWERTYUIOPASDFGHJKLZXCVBNM"
alpha,chars,num=0,0,0
for i in str1:
    if i in sepcial_sym:
        chars+=1
    elif i in digits:
        num+=1
    elif i in letters:
        alpha+=1
print("special charecters",chars)
print(" numbers",num)
print("alphabets",alpha)

special charecters 4
 numbers 3
alphabets 9

2)Write a Python program to find numbers divisible by
nineteen or thirteen from a list of numbers using Lambda.
a=[19, 65, 57, 39, 152, 639, 121, 44, 90, 190]

In [160]:
a=[19, 65, 57, 39, 152, 639, 121, 44, 90, 190]
b=lambda x:(x%19==0) or (x%13==0)
c=list(filter(b,a))
c

[19, 65, 57, 39, 152, 190]

3)Find all of the words in a string that are less than 5 letters.
string = "Practice Problems to Drill List Comprehension in
Your Head."

In [268]:
string = "Practice Problems to Drill List Comprehension in Your Head."
b=string.split()
a=[]
for i in b :
    if len(i)<5:
        a.append(i)
    for j in i:
        if j==".":
            a.append(i.split(".")[0])
print(a)

['to', 'List', 'in', 'Your', 'Head']

4)Calculate income tax for the given income by adhering to the
below rules:
Taxable income Rate (in %)
First $10,000   0
Next $10,000   10
The remaining  20
Expected Output:
For example, suppose the taxable income is 45000 the
income tax payable is:
10000 0% + 10000 10% + 25000 20% = $6000.

In [303]:
def income_tax(income):
    income_tax=((0*10000)+(0.1*10000)+(0.2*(income-20000)))
    return income_tax
income_tax(45000)

6000.0

In [294]:
def calculate_income_tax(income):
    tax = 0
    if income > 20000:
        tax += 10000 * 0
        income -= 10000
    else:
        tax += income * 0
        return tax
    
    if income > 20000:
        tax += 10000 * 0.10
        income -= 10000
    else:
        tax += income * 0.10
        return tax
    
    tax += income * 0.20
    return tax

# Example usage:
income = 45000
income_tax = calculate_income_tax(income)
print("Income tax payable for $", income, "is $", income_tax)

Income tax payable for $ 45000 is $ 6000.0

5)Given below are the list of positive and negative words. Also,
a list of tweets is provided. Separate out the positive and
negative comments.
positive = ['good','awesome', 'best', 'nice']
negative = ['worst','awful', 'bad']
tweets = ['This government policies are good', 'bad
implementation', 'The way he played showed that he is one
of the best players in the world', 'Her acting in the play was
awesome', 'The wine tastes awful', 'It's nice to hear this little

In [147]:
tweets = ["This government policies are good", "bad implementation", 
          "The way he played showed that he is one of the best players in the world",
          "Her acting in the play was awesome", "The wine tastes awful",
          "It's nice to hear this little kid's laugh"]
positive = ['good','awesome', 'best', 'nice']
negative = ['worst','awful', 'bad']
pos_com=[]
neg_com=[]
for i in tweets:
    for j in positive:
        if j in i:
            pos_com.append(i)
print("THE POSITIVE COMMENTS ARE: ",pos_com)
print(end=" ")
for i in tweets:
    for j in negative:
        if j in i:
            neg_com.append(i)
print("THE NEGATIVE COMMENTS ARE:",neg_com)

THE POSITIVE COMMENTS ARE:  ['This government policies are good', 'The way he played showed that he is one of the best players in the world', 'Her acting in the play was awesome', "It's nice to hear this little kid's laugh"]
 THE NEGATIVE COMMENTS ARE: ['bad implementation', 'The wine tastes awful']

6)Extend nested list by adding the sublist.
You have given a nested list. Write a program to extend it by
adding the sublist ["h", "i", "j"] in such a way that it will look
like the following list.
list1 = ["a", "b", ["c", ["d", "e", ["f", "g"], "k"], "l"], "m", "n"]
sub list to add
sub_list = ["h", "i", "j"]
expected output =['a', 'b', ['c', ['d', 'e', ['f', 'g', 'h', 'i', 'j'], 'k'], 'l'],
'm', 'n']

In [175]:
list1 = ["a", "b", ["c", ["d", "e", ["f", "g"], "k"], "l"], "m", "n"]
sub_list = ["h", "i", "j"]
list1[2][1][2].append(sub_list)
print(list1)

['a', 'b', ['c', ['d', 'e', ['f', 'g', ['h', 'i', 'j']], 'k'], 'l'], 'm', 'n']

7)Remove and add item in a list.
Write a program to remove the item present at index 4 and
add it to the 2nd position and at the end of the list.
list1 = [54, 44, 27, 79, 91, 41]

In [203]:
list1 = [54, 44, 27, 79, 91, 41]
a=list1.pop(4)
list1.insert(1,a)
list1.insert(len(list1),a)
print("The new list is",list1)

The new list is [54, 91, 44, 27, 79, 41, 91]

8)Load the iris dataset and Find only those records whose sepal_length = 5.1 and sepal_width = 3.5

In [291]:
import seaborn as sns
df=sns.load_dataset("iris")
df[(df["sepal_length"]==5.1) & (df["sepal_width"]==3.5)]

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
17           5.1          3.5           1.4          0.3  setosa

9)Check for Maximum petal_length and convert it in to 7.2 and min petal_length and convert it in to 1.2

In [292]:
df.petal_length.max()

6.9

In [283]:
df.petal_length.min()

1.0

In [284]:
df.head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [293]:
a=df.petal_length.max()
b=df.petal_length.min()
max_petal_length = 7.2
min_petal_length = 1.2

df.loc[df["petal_length"] == df.iloc[::,2].max()] = max_petal_length
df.iloc[::,2].max()

df.loc[df["petal_length"] == df.iloc[::,2].min()] = min_petal_length
df.iloc[::,2].min()

print("new max petal length",df.iloc[::,2].max())
print("new min petal length",df.iloc[::,2].min())

new max petal length 7.2
new min petal length 1.1

10)Perform right join to combine values based on the 'ID' in the
two dataframes.
Use the dataframe given below, read the DataFrame with the
help of clipboard function.

In [261]:
import pandas as pd
df1=pd.read_clipboard()
df1

    ID Candidate_Name    Subject
0  101           Alex    History
1  102            Amy    English
2  103          Allen  Geography
3  104          Alice     German
4  105          James    History
5  106           Sara     German
6  107            Mia    English

In [262]:
df2=pd.read_clipboard()
df2

    ID       City  Subject_Score
0  101      Delhi             89
1  102     Mumbai             78
2  103      Delhi             77
3  104    Chennai             87
4  105  Hyderabad             87
5  108      Delhi             84

In [263]:
pd.merge?

In [264]:
pd.merge(df1,df2,how="right",on="ID")

    ID Candidate_Name    Subject       City  Subject_Score
0  101           Alex    History      Delhi             89
1  102            Amy    English     Mumbai             78
2  103          Allen  Geography      Delhi             77
3  104          Alice     German    Chennai             87
4  105          James    History  Hyderabad             87
5  108            NaN        NaN      Delhi             84